<a href="https://colab.research.google.com/github/ClauderCarvalho/ABERTO/blob/master/DEZ_TRUQUES_BASICOS_NO_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

Clauder Noronha = 2015

O Pandas é uma poderosa ferramenta de análise e manipulação de dados de código aberto, construída sobre a linguagem de programação Python. Neste artigo, mostrarei 10 truques sobre o DataFrame do pandas para facilitar um pouco mais algumas práticas de programação.

In [0]:
#Criar um DataFrame

df = pd.DataFrame({
    'Paises':['Estados Unidos','Holanda','Espanha','Mexico','Autralia','Brasil'],
     'Capital':['Washington DC','Amsterda','Madrid','Cidade do Mexico','Camberra','Brasilia'],
     'Continente':['America do Norte','Europa','Europa','America do Norte','Oceania','America do Sul'],
     'Idioma':['Ingles','Holandes','Espanhol','Espanhol','Ingles','Portugues']
})

In [14]:
df.head()

           Paises           Capital        Continente    Idioma
0  Estados Unidos     Washington DC  America do Norte    Ingles
1         Holanda          Amsterda            Europa  Holandes
2         Espanha            Madrid            Europa  Espanhol
3          Mexico  Cidade do Mexico  America do Norte  Espanhol
4        Autralia          Camberra           Oceania    Ingles

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Paises      6 non-null      object
 1   Capital     6 non-null      object
 2   Continente  6 non-null      object
 3   Idioma      6 non-null      object
dtypes: object(4)
memory usage: 320.0+ bytes

Usando o locoperador, podemos selecionar subconjuntos de linhas e colunas com base no rótulo do índice e no nome da coluna. Abaixo estão alguns exemplos de como usar o operador loc no DataFrame dos 'países':

In [16]:
df['Paises'].loc[df['Idioma']=='Ingles']

0    Estados Unidos
4          Autralia
Name: Paises, dtype: object

In [17]:
df['Paises']

0    Estados Unidos
1           Holanda
2           Espanha
3            Mexico
4          Autralia
5            Brasil
Name: Paises, dtype: object

In [20]:
df['Paises'].loc[df['Paises']=='Brasil']

5    Brasil
Name: Paises, dtype: object

In [24]:
#Fazer uma busca no DataFrame excluindo a busca da EUROPA
df[~ df.Continente.isin(['Europa'])]

           Paises           Capital        Continente     Idioma
0  Estados Unidos     Washington DC  America do Norte     Ingles
3          Mexico  Cidade do Mexico  America do Norte   Espanhol
4        Autralia          Camberra           Oceania     Ingles
5          Brasil          Brasilia    America do Sul  Portugues


* Alterar Nome


Você pode alterar o nome de certas colunas porque, por exemplo, o nome está incorreto ou incompleto. Por exemplo, convém alterar o nome da coluna 'capital' para 'capital_city' e 'language' para 'most_spoken_language'. Podemos fazer isso da seguinte maneira:

In [28]:
df.rename({'Capital':'capital'})

           Paises           Capital        Continente     Idioma
0  Estados Unidos     Washington DC  America do Norte     Ingles
1         Holanda          Amsterda            Europa   Holandes
2         Espanha            Madrid            Europa   Espanhol
3          Mexico  Cidade do Mexico  America do Norte   Espanhol
4        Autralia          Camberra           Oceania     Ingles
5          Brasil          Brasilia    America do Sul  Portugues

Para reverter a ordem das linhas, usamos o locoperador. Isso funciona da seguinte maneira:

In [29]:
df.loc[:: -1]

           Paises           Capital        Continente     Idioma
5          Brasil          Brasilia    America do Sul  Portugues
4        Autralia          Camberra           Oceania     Ingles
3          Mexico  Cidade do Mexico  America do Norte   Espanhol
2         Espanha            Madrid            Europa   Espanhol
1         Holanda          Amsterda            Europa   Holandes
0  Estados Unidos     Washington DC  America do Norte     Ingles

No entanto, observe que agora os índices ainda estão seguindo a ordem anterior. Temos que fazer uso da reset_indexfunção para redefinir os índices:

In [30]:
df.loc[:: -1].reset_index(drop =True)

           Paises           Capital        Continente     Idioma
0          Brasil          Brasilia    America do Sul  Portugues
1        Autralia          Camberra           Oceania     Ingles
2          Mexico  Cidade do Mexico  America do Norte   Espanhol
3         Espanha            Madrid            Europa   Espanhol
4         Holanda          Amsterda            Europa   Holandes
5  Estados Unidos     Washington DC  America do Norte     Ingles

Em alguns casos, queremos dividir um DataFrame em dois subconjuntos aleatórios . Para isso, fazemos uso da samplefunção Por exemplo, ao criar um treinamento e um conjunto de testes com todo o conjunto de dados, precisamos criar dois subconjuntos aleatórios. Abaixo, mostramos como usar a samplefunção:

In [0]:
df_1 = df.sample(frac = 0,6, random_state = 999)
df_2 = df.drop(df_1.index)

Outro Exemplo

In [0]:
alunos = pd.DataFrame({
    'Nome':['Clauder','Noronha','Carvalho','Cris'],
    'Sexo':['Masc','Masc','Masc','Fem']
})

In [34]:
alunos.head()

       Nome  Sexo
0   Clauder  Masc
1   Noronha  Masc
2  Carvalho  Masc
3      Cris   Fem

Podemos criar uma variável dummy a partir de variáveis ​​categóricas. Podemos fazer isso usando a get_dummiesfunção:

In [35]:
pd.get_dummies(alunos)

   Nome_Carvalho  Nome_Clauder  Nome_Cris  Nome_Noronha  Sexo_Fem  Sexo_Masc
0              0             1          0             0         0          1
1              0             0          0             1         0          1
2              1             0          0             0         0          1
3              0             0          1             0         1          0

Para se livrar das colunas redundantes, precisamos adicionar

In [0]:
drop_first=True

In [38]:
pd.get_dummies(alunos, drop_first= True)

   Nome_Clauder  Nome_Cris  Nome_Noronha  Sexo_Masc
0             1          0             0          1
1             0          0             1          1
2             0          0             0          1
3             0          1             0          0